app/views/languages/show.erb

SELECT "editors".* FROM "editors" INNER JOIN "languages_editors" ON "editors"."id" = "languages_editors"."editor_id" WHERE "languages_editors"."language_id" = ?  [["language_id", 1]]
---
    <div style='text-align:center'>
      <%@language.editors.each do |editor|%>