app/views/users/workstyle.erb

SELECT "companies".* FROM "companies"
---
  <datalist id="company-name">
    <% Company.all.each do |company| %>