app/controllers/application_controller.rb

  def recommended
    @params = params
    @company = Company.find_by({name: params[:company]})
    @user = User.all.last
    @user.company = @company
    @user.save
---
SELECT  "companies".* FROM "companies" WHERE "companies"."name" = ? LIMIT ?  [["name", "Google"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "company" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["company", "#<Company:0x007fe9b6fd00f0>"], ["updated_at", "2017-10-03 00:38:02.187891"], ["id", 1]]