app/controllers/editors_controller.rb

  def index
    @editors = Editor.all
---
SELECT "editors".* FROM "editors"

  def show
    @editor = Editor.find(params[:id])
---
SELECT  "editors".* FROM "editors" WHERE "editors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]