app/controllers/languages_controller.rb

SELECT "languages".* FROM "languages"
---
  def index
    @languages = Language.all

SELECT  "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @language = Language.find(params[:id])