app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "TheAshes"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(name: params[:user][:name])