app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "user_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    @user = User.find(params[:id])
    @languages = []
    @companies = []

    if session[:user_id] != @user.id
      redirect_to home_path
    end

    @user.complete_personality_score

    if @user.personality_score == 3 || @user.personality_score == 7 || @user.personality_score == 12
      Company.culture_companies.each do |company|
        @companies << company.name
      end
    elsif @user.personality_score == 11 || @user.personality_score == 15 || @user.personality_score == 20
      Company.work_life_companies.each do |company|
        @companies << company.name
      end
    elsif @user.personality_score == 21 || @user.personality_score == 25 || @user.personality_score == 30
      Company.compensation_companies.each do |company|
        @companies << company.name
      end
    else
      @companies << Company.all.sample.name
    end


    Language.all.each do |l|
      l.companies.each do |c|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "companies".* FROM "companies"
SELECT "languages".* FROM "languages"
SELECT "companies".* FROM "companies" INNER JOIN "companies_languages" ON "companies"."id" = "companies_languages"."company_id" WHERE "companies_languages"."language_id" = ?  [["language_id", 1]]

  def workstyle
    @user = current_user
    @companies = []

    Company.all.each do |company|
---
SELECT "companies".* FROM "companies"

  def update
    @user = current_user
    if @user.update(user_params)
---
UPDATE "users" SET "response_one" = ?, "response_two" = ?, "response_three" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["response_one", "Compensation"], ["response_two", "Batman"], ["response_three", "Lucky Charms"], ["updated_at", "2017-10-05 19:50:59.281458"], ["id", 2]]