app/views/application/home.erb

    <div class="row">
      <% Language.all.each_with_index do |language, i| %>
---
SELECT "languages".* FROM "languages"