app/views/application/recommended.erb

<% @company.languages.each do |language| %>
---
SELECT "languages".* FROM "languages" INNER JOIN "companies_languages" ON "languages"."id" = "companies_languages"."language_id" WHERE "companies_languages"."company_id" = ?  [["company_id", 1]]